#+TITLE: Section 3.2
#+AUTHOR: Nicky

#+OPTIONS: toc:nil author:nil date:nil title:t

#+LATEX_CLASS: subfiles
#+LATEX_CLASS_OPTIONS: [sicm_sagemath]

#+PROPERTY: header-args:sage :session section32 :eval never-export :exports code :results none :tangle ../sage/section3.2.sage :dir ../sage

#+begin_src emacs-lisp :exports results :results none :eval export
  (make-variable-buffer-local 'org-latex-title-command)
  ; (setq org-latex-title-command (concat "\\chapter{%t}\n"))
#+end_src


* Poisson Brackets


** The standard imports.

#+begin_src sage
load(
    "utils.sage",
    "utils1.6.sage",
    "utils3.1.sage",
    "utils3.2.sage",
)

var("t", domain="real")
#+end_src



#+begin_src sage :exports code  :tangle no
load("show_expression.sage")
#+end_src

** The Poisson Bracket

I make two implementations: one is more or less standard Python code, the second maximizes the amount of functional programming.

This is the first.
#+begin_src sage :eval never
def Poisson_bracket(F, G):
    def f(state):
        left = partial(F, 1)(state) * partial(G, 2)(state).T
        right = partial(F, 2)(state) * partial(G, 1)(state).T
        return (left - right).simplify_full()

    return f
#+end_src

For the second I need two helper functions that are self explanatory.
#+begin_src sage :tangle ../sage/utils3.2.sage
def transpose(M):
    return M.T


def simplify(expr):
    return expr.simplify_full()
#+end_src

This is the second implementation

#+begin_src sage :tangle ../sage/utils3.2.sage
def Poisson_bracket(F, G):
    def f(state):
        return Compose(
            simplify,
            Sum(
                Product(partial(F, 1), Compose(transpose, partial(G, 2))),
                Min(Product(partial(F, 2), Compose(transpose, partial(G, 1)))),
            ),
        )(state)

    return f
#+end_src

The first test is to see whether $\{Q, H\} = \partial_{2} H$ and $\{P, H\} = -\partial_{1} H$, where $Q$ and $P$ are the coordinate and momentum selectors.
For the Hamiltonian I take a general function and  check $\{Q_{0}, H\}$, $\{P_{0}, H\}$, and $\{Q, H\}$.

#+begin_src sage :exports both :results replace latex
space = make_space("q", dim=2)

def Hamiltonian(local):
    return function("H")(time(local), *coordinate(local), *velocity(local))


show(Poisson_bracket(lambda local: coordinate(local)[0], Hamiltonian)(space))
show(Poisson_bracket(lambda local: momentum(local)[0], Hamiltonian)(space))
show(Poisson_bracket(coordinate, Hamiltonian)(space))
show(Poisson_bracket(coordinate, momentum)(space))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
\left(\begin{array}{r}
\frac{\partial}{\partial {\dot q_1}}H\left(t, {q_1}, {q_2}, {\dot q_1}, {\dot q_2}\right)
\end{array}\right)
\end{dmath*}
\begin{dmath*}
\left(\begin{array}{r}
-\frac{\partial}{\partial {q_1}}H\left(t, {q_1}, {q_2}, {\dot q_1}, {\dot q_2}\right)
\end{array}\right)
\end{dmath*}
\begin{dmath*}
\left(\begin{array}{r}
\frac{\partial}{\partial {\dot q_1}}H\left(t, {q_1}, {q_2}, {\dot q_1}, {\dot q_2}\right) \\
\frac{\partial}{\partial {\dot q_2}}H\left(t, {q_1}, {q_2}, {\dot q_1}, {\dot q_2}\right)
\end{array}\right)
\end{dmath*}
\begin{dmath*}
\left(\begin{array}{rr}
1 & 0 \\
0 & 1
\end{array}\right)
\end{dmath*}
#+end_export

All is correct.

** Properties of the Poisson bracket

We know that $\{F, F\} = 0$ for any functions.
Let's test this for our implementation.

#+begin_src sage :exports both :results replace latex
def F(local):
    return function("f")(time(local), *coordinate(local), *velocity(local))

show(Poisson_bracket(F, F)(space))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
\left(\begin{array}{r}
0
\end{array}\right)
\end{dmath*}
#+end_export


The property $\{F, F\} = 0$ is actually implied when we can show that the Poisson bracket is anti-symmetric.
We need an extra function to check the anti-symmetry.
#+begin_src sage
def G(local):
    return function("g")(time(local), *coordinate(local), *velocity(local))
#+end_src

#+begin_src sage :exports both :results replace latex
show(Sum(Poisson_bracket(F, G), Poisson_bracket(G, F))(space))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
\left(\begin{array}{r}
0
\end{array}\right)
\end{dmath*}
#+end_export


How about $\{F, G+H\} = \{F, G\} + \{F, H\}$?
#+begin_src sage :exports both :results replace latex
def H(local):
    return function("h")(time(local), *coordinate(local), *velocity(local))


show(
    Poisson_bracket(F, Sum(G, H))(space)
    == Sum(Poisson_bracket(F, G), Poisson_bracket(F, H))(space)
)
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
\mathrm{True}
\end{dmath*}
#+end_export

To check the rule $\{F, c G\} = c\{F, G\}$ we need a constant function.
By making the next ~function~ independent of any argument, it becomes constant.
#+begin_src sage
def constant(local):
    return function("c")()
#+end_src

Is it indeed constant?
#+begin_src sage :exports both :results replace latex
show(diff(constant(space), time(space)))
show(diff(constant(space), *coordinate(space)))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
0
\end{dmath*}
\begin{dmath*}
0
\end{dmath*}
#+end_export

So, next we can check $\{F, cG\}$.
#+begin_src sage :exports both :results replace latex
show(
    Poisson_bracket(F, Product(constant, G))(space)
    == Product(constant, Poisson_bracket(F, G))(space)
)
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
\mathrm{True}
\end{dmath*}
#+end_export



Finally, here is the check on Jacobi's identity.
#+begin_src sage :exports both :results replace latex
jacobi = Compose(
    simplify,
    Sum(
        Poisson_bracket(F, Poisson_bracket(G, H)),
        Poisson_bracket(G, Poisson_bracket(H, F)),
        Poisson_bracket(H, Poisson_bracket(F, G)),
    ),
)
show(jacobi(space))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
\left(\begin{array}{r}
0
\end{array}\right)
\end{dmath*}
#+end_export

** Poisson bracket of conserved quantities

To check that the Poisson bracket of a conserved quantity is conserved we need a function that does not depend on time.
#+begin_src sage
def F(local):
    return function("f")(*coordinate(local), *velocity(local))
#+end_src

Clearly, the derivative with respect to time of this function is zero, so it does what we need.

#+begin_src sage :exports both :results replace latex
show(diff(F(space), time(space)))
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
0
\end{dmath*}
#+end_export

Now consider $\{F, H\}$ where $H$ is the rectangular Hamiltonian.
#+begin_src sage
def V(q):
    return function("U")(*q)


var(m, domain="positive")

H = H_rectangular(m, V)
#+end_src

I compute the Poisson bracket of $F$ and $H$ for one dimension so that the result remains small.
#+begin_src sage :exports both :results replace latex
space = make_space("q", dim=1)
show(Poisson_bracket(F, H)(space).expand()[0, 0])
#+end_src

#+RESULTS:
#+begin_export latex
\begin{dmath*}
-\frac{\partial}{\partial {q_1}}U\left({q_1}\right) \frac{\partial}{\partial {\dot q_1}}f\left({q_1}, {\dot q_1}\right) + \frac{{\dot q_1} \frac{\partial}{\partial {q_1}}f\left({q_1}, {\dot q_1}\right)}{m}
\end{dmath*}
#+end_export

To complete the check, note that, by Hamilton's equation,  $\dot q = \partial H/ \partial p$, $\dot p = - \partial H/ \partial q$.
If we replace that in the above equation we obtain $\dot p \partial F/\partial \dot q + \dot q \partial F/\partial q$, but this is equal to $\d F/\d t$, and since $F$ is conserved, the total time derivative of $F$ is zero.
